import { Shield, BatteryCharging, Smartphone, Camera } from "lucide-react";

export const productsSeed = [
  {
    name: "Портативная электростанция OUKITEL P1000E PLUS 1800 Вт/1024 Вт·ч",
    slug: "oukitel-p1000e-plus-1800",
    price: "349 000₸",
    // oldPrice: "€549,00",
    // rating: 4.7,
    // reviewsCount: 106,
    chips: ["OUKITEL P1000E PLUS 1800", "1800 Вт/1024 Вт·ч"],
    icon: BatteryCharging,
    images: [
      "https://eu.oukitel.com/cdn/shop/files/2_828108ea-48fa-413f-ab48-66db9411e259_720x.jpg?v=1742438969",
      "https://eu.oukitel.com/cdn/shop/files/3_86883247-db72-49d8-8156-3548e2502b0b_1800x1800.jpg?v=1742438968",
      "https://eu.oukitel.com/cdn/shop/files/1_5cf284b0-bd0f-45fa-9f60-3040eb9975c1_1800x1800.jpg?v=1749708645",
      "https://eu.oukitel.com/cdn/shop/files/4_26c111e5-ab3a-4498-84e2-fa44d1fb5908_1800x1800.jpg?v=1749708645",
      "https://eu.oukitel.com/cdn/shop/files/5_fdb2a128-b09f-444c-a769-bf90be5be737_1800x1800.jpg?v=1749708645",
      "https://eu.oukitel.com/cdn/shop/files/PV100_078e7a1b-6095-49bf-b941-7abd44cec63f_1800x1800.jpg?v=1749708645"
    ],
    short: "Отправка со склада в Алматы для быстрой доставки по Казахстану.",
    description:
      "Выходная мощность 1800 Вт — обеспечивает питание 99% бытовых приборов.\nМеньший размер — всего 12 кг по сравнению с аналогичными товарами.\nБыстрая зарядка переменным током 1200 Вт — от 0 до 80% за 39 минут.\nСверхтихий звук 29 дБ＜500 Вт — возможность спокойно спать.\n1800 Вт EPS < 10 мс  - Для предотвращения неожиданных отключений электроэнергии\nНадежный литий-железо-фосфатный аккумулятор — 4000 циклов зарядки/разрядки, срок службы до 10 лет.\nИнтеллектуальное управление через приложение — мониторинг по Bluetooth и Wi-Fi. \nМаксимальная потребляемая мощность солнечной энергии : 500 Вт. Переходите на экологически чистую солнечную энергию!"
  },

  {
    name: "Портативная электростанция OUKITEL P2001 Plus 2400 Вт | 2048 Вт·ч",
    slug: "oukitel-p2001-plus-2400",
    price: "550 000₸",
    // oldPrice: "€799,00",
    // rating: 4.6,
    // reviewsCount: 84,
    chips: ["OUKITEL P2001 Plus", "2400 Вт/2048 Вт·ч"],
    icon: BatteryCharging,
    images: [
      "https://eu.oukitel.com/cdn/shop/files/P2001Plus_f7c8526f-0996-4ad6-a1b9-c38d3bed1317_1800x1800.jpg?v=1720604045",
      "https://eu.oukitel.com/cdn/shop/files/P2001Plus_c5696918-612c-403f-a08c-43e90ab2fa16_1800x1800.jpg?v=1720604045",
      "https://eu.oukitel.com/cdn/shop/files/P2001Plus_3cb4095d-5954-4624-908b-2cd60f522d5c_1800x1800.jpg?v=1720604045",
      "https://eu.oukitel.com/cdn/shop/files/P2001Plus_f3b2b378-fc45-4ad5-93ac-f76fa90391bf_1800x1800.jpg?v=1720604045",
      "https://eu.oukitel.com/cdn/shop/files/P2001Plus_PV200_1800x1800.jpg?v=1720604045",
      "https://eu.oukitel.com/cdn/shop/files/P2001Plus_PV400_1800x1800.jpg?v=1720604045",
      "https://eu.oukitel.com/cdn/shop/files/p2400_1800x1800.png?v=1748400067"
    ],
    short: "Отправка со склада в Алматы для быстрой доставки по Казахстану.",
    description:
      "Входная мощность переменного тока 1800 Вт - зарядка до 80% всего за 1 час.\nРегулировочный регулятор зарядки - позволяет установить мощность 400 Вт/800 Вт/1200 Вт/1800 Вт.\nИнвертор с чистой синусоидальной волной, выходная мощность 2400 Вт переменного тока (пиковая мощность 4800 Вт).\n2000 Вт EPS < 10 мс - Для предотвращения неожиданных отключений электроэнергии\nУровень шума < 50 дБ - Возможность спокойно спать.\nКомплексная защита: защита от брызг и пыли. \nИнтеллектуальное управление через приложение — мониторинг по Bluetooth и Wi-Fi. \nНадежный литий-железо-фосфатный аккумулятор — более 3500 циклов зарядки/разрядки, срок службы до 10 лет.\nМаксимальная потребляемая мощность солнечной энергии : 500 Вт. Переходите на экологически чистую солнечную энергию!"
  },

  {
    name: "Портативная электростанция OUKITEL P800 800 Вт | 512 Вт·ч",
    slug: "oukitel-p800",
    price: "178 500₸",
    // oldPrice: "€269,00",
    // rating: 4.5,
    // reviewsCount: 51,
    chips: ["OUKITEL P800", "800 Вт/512 Вт·ч"],
    icon: BatteryCharging,
    images: [
      "https://eu.oukitel.com/cdn/shop/files/P800-Poratble-power-station-800W-512Wh-emergency-power-supply_1800x1800.jpg?v=1766559132",
      "https://eu.oukitel.com/cdn/shop/files/1_970fbece-22e8-4366-8113-e8340d7f4452_1800x1800.jpg?v=1753864333",
      "https://eu.oukitel.com/cdn/shop/files/2_71e244c5-327d-4350-ac70-f7648d2bafa5_1800x1800.jpg?v=1753864333",
      "https://eu.oukitel.com/cdn/shop/files/PV100_P800y_1800x1800.jpg?v=1754443266",
      "https://eu.oukitel.com/cdn/shop/files/PV200_P800y_1800x1800.jpg?v=1754443266"
    ],
    short: "Отправка со склада в Алматы для быстрой доставки по Казахстану.",
    description:
      "Вес 6 кг, легко переносить:  поднимать одной рукой, не создает дополнительной нагрузки в пути.\nСрок службы 10 лет: литий-железо-фосфатный аккумулятор, 3500 циклов.\nВыходная мощность переменного тока 800 Вт: емкость 512 Вт·ч, позволяет питать несколько устройств.\n8 выходных портов: одновременная зарядка, удобно.\nБыстрая зарядка от сети переменного тока мощностью 500 Вт: полная зарядка за 1 час.\nСолнечная зарядка мощностью до 200 Вт: полная зарядка за 2 часа 45 минут, экологически чистая энергия.\nПереключение EPS < 10 мс: бесшовное, предотвращает потери из-за сбоев.\nСветодиодный светильник мощностью 3 Вт: практичное базовое освещение.\nМногоцелевое использование: подходит для кемпинга, чрезвычайных ситуаций и офиса."
  },

  {
    name: "Портативная солнечная панель OUKITEL 400 Вт",
    slug: "solar-panel-oukitel-400",
    price: "250 000₸",
    // oldPrice: "€599,00",
    // rating: 4.6,
    // reviewsCount: 72,
    chips: ["OUKITEL 400", "400 Вт"],
    icon: BatteryCharging,
    images: [
      "https://eu.oukitel.com/cdn/shop/products/400W_1800x1800.jpg?v=1684995942",
      "https://eu.oukitel.com/cdn/shop/products/400W-2_1800x1800.jpg?v=1684995951"
    ],
    short: "Отправка со склада в Алматы для быстрой доставки по Казахстану.",
    description:
      "Солнечная энергия мощностью 400 Вт для быстрой зарядки\nКоэффициент конверсии до 24,8%. \nДолговечное покрытие из ETFE.\nКомпактная и складная конструкция\nСтепень защиты от брызг IP68 S\nПрочный и устойчивый к погодным условиям.\nЭкологичное решение для электроснабжения\nСовместимо с электростанциями OUKITEL и большинством электростанций сторонних производителей."
  }
];
